# Вычислить число c заданной точностью d
# Пример:
# - при d = 0.001, π = 3.142,    10^(-1) ≤ d ≤10^(-10)

d = input('Введите число: ')
a = 2.3456765
x = int(len(d.split('.', )[1]))
print(f'Число = {round(a, x)}')
